## Deployment failed for PR-3! :x:

### Errors:

```json

error provisioning resource mysql#modules.node-workload.externals.db GuResID: 8ae109768e81116070a7c149e281f73f84217195. Status: False. Reason: DriverFailed. Message: unexpected response code (400) and error provisioning the resource: RES-004: Invalid value for input variable: The given value is not suitable for var.enabled_cloudwatch_logs_exports declared at variables.tf:126,1-43: set of string required. (on /home/runneruser/workspace/inputs/inputs.json line 1:  1: {"allocated_storage":20,"app_id":"node11","backup_retention_period":1,"create_cloudwatch_log_group":false,"create_db_subnet_group":true,"create_monitoring_role":true,"database_name":"my_database","deletion_protection":false,"enabled_cloudwatch_logs_exports":{},"engine":"mysql","engine_version":"8.0","env_id":"pr-3","group_family":"mysql8.0","instance_class":"db.t4g.large","major_engine_version":"8.0","max_allocated_storage":100,"monitoring_interval":60,"monitoring_role_description":"Monitoring role for RDS basic cluster","monitoring_role_name":"rds-basic-monitoring-role","monitoring_role_use_name_prefix":true,"multi_az":true,"name":"hum-mysql-pr-3","parameters":{},"password":"password","performance_insights_enabled":true,"performance_insights_retention_period":7,"port":3306,"prefix":"hum-pr-3","region":"us-east-2","res_id":"modules.node-workload.externals.db","skip_final_snapshot":true,"subnet_ids":["subnet-00fd074a0dd669e94","subnet-07e91cb234d6e2f6d"],"username":"username","vpc_security_group_ids":["sg-0cb0afd368a823caf"]})

---

Downloading scripts / inputs / files from storage ...
Preparing a new workspace at '/home/runneruser/workspace/src'...
Fetching script files from 'https://github.com/humanitec-architecture/resource-packs-aws.git/modules/rds/basic' (refs/heads/main)...
Applying local scripts and overrides from '/home/runneruser/workspace/script'...
Checking for previous terraform resource state files...
Executing terraform init...
{
  "terraform_version": "1.5.7",
  "platform": "linux_amd64",
  "provider_selections": {},
  "terraform_outdated": true
}

Initializing the backend...
Initializing modules...
Downloading registry.terraform.io/terraform-aws-modules/rds/aws 6.3.0 for db...
- db in .terraform/modules/db
- db.db_instance in .terraform/modules/db/modules/db_instance
- db.db_instance_role_association in .terraform/modules/db/modules/db_instance_role_association
- db.db_option_group in .terraform/modules/db/modules/db_option_group
- db.db_parameter_group in .terraform/modules/db/modules/db_parameter_group
- db.db_subnet_group in .terraform/modules/db/modules/db_subnet_group

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0, >= 5.25.0"...
- Finding hashicorp/random versions matching ">= 3.1.0"...
- Installing hashicorp/random v3.6.3...
- Installed hashicorp/random v3.6.3 (signed by HashiCorp)
- Installing hashicorp/aws v5.72.1...
- Installed hashicorp/aws v5.72.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
Executing terraform apply...
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created
  + resource "aws_iam_role" "enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Monitoring role for RDS basic cluster"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "rds-basic-monitoring-role-"
      + path                  = "/"
      + tags                  = {
          + "Name" = "rds-basic-monitoring-role"
        }
      + tags_all              = {
          + "Name"       = "rds-basic-monitoring-role"
          + "hum:app"    = "node11"
          + "hum:env"    = "pr-3"
          + "hum:res"    = "modules.node-workload.externals.db"
          + "humanitec"  = "true"
          + "managed_by" = "terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = (known after apply)
    }

  # module.db.module.db_option_group.aws_db_option_group.this[0] will be created
  + resource "aws_db_option_group" "this" {
      + arn                      = (known after apply)
      + engine_name              = "mysql"
      + id                       = (known after apply)
      + major_engine_version     = "8.0"
      + name                     = (known after apply)
      + name_prefix              = "hum-mysql-pr-3-"
      + option_group_description = "hum-mysql-pr-3 option group"
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "hum-mysql-pr-3"
        }
      + tags_all                 = {
          + "Name"       = "hum-mysql-pr-3"
          + "hum:app"    = "node11"
          + "hum:env"    = "pr-3"
          + "hum:res"    = "modules.node-workload.externals.db"
          + "humanitec"  = "true"
          + "managed_by" = "terraform"
        }

      + timeouts {}
    }

  # module.db.module.db_subnet_group.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "hum-pr-3node11-pr-3-modules-node-workload-externals-db subnet group"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = "hum-pr-3node11-pr-3-modules-node-workload-externals-db-"
      + subnet_ids              = [
          + "subnet-00fd074a0dd669e94",
          + "subnet-07e91cb234d6e2f6d",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "hum-pr-3node11-pr-3-modules-node-workload-externals-db"
        }
      + tags_all                = {
          + "Name"       = "hum-pr-3node11-pr-3-modules-node-workload-externals-db"
          + "hum:app"    = "node11"
          + "hum:env"    = "pr-3"
          + "hum:res"    = "modules.node-workload.externals.db"
          + "humanitec"  = "true"
          + "managed_by" = "terraform"
        }
      + vpc_id                  = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + password = (sensitive value)

Error: Invalid value for input variable

  on /home/runneruser/workspace/inputs/inputs.json line 1:
   1: {"allocated_storage":20,"app_id":"node11","backup_retention_period":1,"create_cloudwatch_log_group":false,"create_db_subnet_group":true,"create_monitoring_role":true,"database_name":"my_database","deletion_protection":false,"enabled_cloudwatch_logs_exports":{},"engine":"mysql","engine_version":"8.0","env_id":"pr-3","group_family":"mysql8.0","instance_class":"db.t4g.large","major_engine_version":"8.0","max_allocated_storage":100,"monitoring_interval":60,"monitoring_role_description":"Monitoring role for RDS basic cluster","monitoring_role_name":"rds-basic-monitoring-role","monitoring_role_use_name_prefix":true,"multi_az":true,"name":"hum-mysql-pr-3","parameters":{},"password":"password","performance_insights_enabled":true,"performance_insights_retention_period":7,"port":3306,"prefix":"hum-pr-3","region":"us-east-2","res_id":"modules.node-workload.externals.db","skip_final_snapshot":true,"subnet_ids":["subnet-00fd074a0dd669e94","subnet-07e91cb234d6e2f6d"],"username":"username","vpc_security_group_ids":["sg-0cb0afd368a823caf"]}

The given value is not suitable for var.enabled_cloudwatch_logs_exports
declared at variables.tf:126,1-43: set of string required.

Error: Invalid value for input variable

  on /home/runneruser/workspace/inputs/inputs.json line 1:
   1: {"allocated_storage":20,"app_id":"node11","backup_retention_period":1,"create_cloudwatch_log_group":false,"create_db_subnet_group":true,"create_monitoring_role":true,"database_name":"my_database","deletion_protection":false,"enabled_cloudwatch_logs_exports":{},"engine":"mysql","engine_version":"8.0","env_id":"pr-3","group_family":"mysql8.0","instance_class":"db.t4g.large","major_engine_version":"8.0","max_allocated_storage":100,"monitoring_interval":60,"monitoring_role_description":"Monitoring role for RDS basic cluster","monitoring_role_name":"rds-basic-monitoring-role","monitoring_role_use_name_prefix":true,"multi_az":true,"name":"hum-mysql-pr-3","parameters":{},"password":"password","performance_insights_enabled":true,"performance_insights_retention_period":7,"port":3306,"prefix":"hum-pr-3","region":"us-east-2","res_id":"modules.node-workload.externals.db","skip_final_snapshot":true,"subnet_ids":["subnet-00fd074a0dd669e94","subnet-07e91cb234d6e2f6d"],"username":"username","vpc_security_group_ids":["sg-0cb0afd368a823caf"]}

The given value is not suitable for var.parameters declared at
variables.tf:176,1-22: set of any single type required.


```

<details><summary>Errors details</summary>

### Errors details:
```json

[
  {
    "apiVersion": "entity.humanitec.io/v1b1",
    "entity": {},
    "kind": "DeploymentError",
    "metadata": {
      "app_id": "node11",
      "deploy_id": "17ff59b3ac49904f",
      "env_id": "pr-3",
      "org_id": "htc-demo-41"
    },
    "status": {
      "code": "OPR-001",
      "error_type": "",
      "message": "error provisioning resource mysql#modules.node-workload.externals.db GuResID: 8ae109768e81116070a7c149e281f73f84217195. Status: False. Reason: DriverFailed. Message: unexpected response code (400) and error provisioning the resource: RES-004: Invalid value for input variable: The given value is not suitable for var.enabled_cloudwatch_logs_exports declared at variables.tf:126,1-43: set of string required. (on /home/runneruser/workspace/inputs/inputs.json line 1:  1: {\"allocated_storage\":20,\"app_id\":\"node11\",\"backup_retention_period\":1,\"create_cloudwatch_log_group\":false,\"create_db_subnet_group\":true,\"create_monitoring_role\":true,\"database_name\":\"my_database\",\"deletion_protection\":false,\"enabled_cloudwatch_logs_exports\":{},\"engine\":\"mysql\",\"engine_version\":\"8.0\",\"env_id\":\"pr-3\",\"group_family\":\"mysql8.0\",\"instance_class\":\"db.t4g.large\",\"major_engine_version\":\"8.0\",\"max_allocated_storage\":100,\"monitoring_interval\":60,\"monitoring_role_description\":\"Monitoring role for RDS basic cluster\",\"monitoring_role_name\":\"rds-basic-monitoring-role\",\"monitoring_role_use_name_prefix\":true,\"multi_az\":true,\"name\":\"hum-mysql-pr-3\",\"parameters\":{},\"password\":\"password\",\"performance_insights_enabled\":true,\"performance_insights_retention_period\":7,\"port\":3306,\"prefix\":\"hum-pr-3\",\"region\":\"us-east-2\",\"res_id\":\"modules.node-workload.externals.db\",\"skip_final_snapshot\":true,\"subnet_ids\":[\"subnet-00fd074a0dd669e94\",\"subnet-07e91cb234d6e2f6d\"],\"username\":\"username\",\"vpc_security_group_ids\":[\"sg-0cb0afd368a823caf\"]})\n\n---\n\nDownloading scripts / inputs / files from storage ...\nPreparing a new workspace at '/home/runneruser/workspace/src'...\nFetching script files from 'https://github.com/humanitec-architecture/resource-packs-aws.git/modules/rds/basic' (refs/heads/main)...\nApplying local scripts and overrides from '/home/runneruser/workspace/script'...\nChecking for previous terraform resource state files...\nExecuting terraform init...\n{\n  \"terraform_version\": \"1.5.7\",\n  \"platform\": \"linux_amd64\",\n  \"provider_selections\": {},\n  \"terraform_outdated\": true\n}\n\nInitializing the backend...\nInitializing modules...\nDownloading registry.terraform.io/terraform-aws-modules/rds/aws 6.3.0 for db...\n- db in .terraform/modules/db\n- db.db_instance in .terraform/modules/db/modules/db_instance\n- db.db_instance_role_association in .terraform/modules/db/modules/db_instance_role_association\n- db.db_option_group in .terraform/modules/db/modules/db_option_group\n- db.db_parameter_group in .terraform/modules/db/modules/db_parameter_group\n- db.db_subnet_group in .terraform/modules/db/modules/db_subnet_group\n\nInitializing provider plugins...\n- Finding hashicorp/aws versions matching \"~\u003e 5.0, \u003e= 5.25.0\"...\n- Finding hashicorp/random versions matching \"\u003e= 3.1.0\"...\n- Installing hashicorp/random v3.6.3...\n- Installed hashicorp/random v3.6.3 (signed by HashiCorp)\n- Installing hashicorp/aws v5.72.1...\n- Installed hashicorp/aws v5.72.1 (signed by HashiCorp)\n\nTerraform has created a lock file .terraform.lock.hcl to record the provider\nselections it made above. Include this file in your version control repository\nso that Terraform can guarantee to make the same selections by default when\nyou run \"terraform init\" in the future.\n\nTerraform has been successfully initialized!\nExecuting terraform apply...\nmodule.db.module.db_instance.data.aws_partition.current: Reading...\nmodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...\nmodule.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]\nmodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]\n\nTerraform used the selected providers to generate the following execution\nplan. Resource actions are indicated with the following symbols:\n  + create\n\nTerraform planned the following actions, but then encountered a problem:\n\n  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created\n  + resource \"aws_iam_role\" \"enhanced_monitoring\" {\n      + arn                   = (known after apply)\n      + assume_role_policy    = jsonencode(\n            {\n              + Statement = [\n                  + {\n                      + Action    = \"sts:AssumeRole\"\n                      + Effect    = \"Allow\"\n                      + Principal = {\n                          + Service = \"monitoring.rds.amazonaws.com\"\n                        }\n                    },\n                ]\n              + Version   = \"2012-10-17\"\n            }\n        )\n      + create_date           = (known after apply)\n      + description           = \"Monitoring role for RDS basic cluster\"\n      + force_detach_policies = false\n      + id                    = (known after apply)\n      + managed_policy_arns   = (known after apply)\n      + max_session_duration  = 3600\n      + name                  = (known after apply)\n      + name_prefix           = \"rds-basic-monitoring-role-\"\n      + path                  = \"/\"\n      + tags                  = {\n          + \"Name\" = \"rds-basic-monitoring-role\"\n        }\n      + tags_all              = {\n          + \"Name\"       = \"rds-basic-monitoring-role\"\n          + \"hum:app\"    = \"node11\"\n          + \"hum:env\"    = \"pr-3\"\n          + \"hum:res\"    = \"modules.node-workload.externals.db\"\n          + \"humanitec\"  = \"true\"\n          + \"managed_by\" = \"terraform\"\n        }\n      + unique_id             = (known after apply)\n    }\n\n  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created\n  + resource \"aws_iam_role_policy_attachment\" \"enhanced_monitoring\" {\n      + id         = (known after apply)\n      + policy_arn = \"arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole\"\n      + role       = (known after apply)\n    }\n\n  # module.db.module.db_option_group.aws_db_option_group.this[0] will be created\n  + resource \"aws_db_option_group\" \"this\" {\n      + arn                      = (known after apply)\n      + engine_name              = \"mysql\"\n      + id                       = (known after apply)\n      + major_engine_version     = \"8.0\"\n      + name                     = (known after apply)\n      + name_prefix              = \"hum-mysql-pr-3-\"\n      + option_group_description = \"hum-mysql-pr-3 option group\"\n      + skip_destroy             = false\n      + tags                     = {\n          + \"Name\" = \"hum-mysql-pr-3\"\n        }\n      + tags_all                 = {\n          + \"Name\"       = \"hum-mysql-pr-3\"\n          + \"hum:app\"    = \"node11\"\n          + \"hum:env\"    = \"pr-3\"\n          + \"hum:res\"    = \"modules.node-workload.externals.db\"\n          + \"humanitec\"  = \"true\"\n          + \"managed_by\" = \"terraform\"\n        }\n\n      + timeouts {}\n    }\n\n  # module.db.module.db_subnet_group.aws_db_subnet_group.this[0] will be created\n  + resource \"aws_db_subnet_group\" \"this\" {\n      + arn                     = (known after apply)\n      + description             = \"hum-pr-3node11-pr-3-modules-node-workload-externals-db subnet group\"\n      + id                      = (known after apply)\n      + name                    = (known after apply)\n      + name_prefix             = \"hum-pr-3node11-pr-3-modules-node-workload-externals-db-\"\n      + subnet_ids              = [\n          + \"subnet-00fd074a0dd669e94\",\n          + \"subnet-07e91cb234d6e2f6d\",\n        ]\n      + supported_network_types = (known after apply)\n      + tags                    = {\n          + \"Name\" = \"hum-pr-3node11-pr-3-modules-node-workload-externals-db\"\n        }\n      + tags_all                = {\n          + \"Name\"       = \"hum-pr-3node11-pr-3-modules-node-workload-externals-db\"\n          + \"hum:app\"    = \"node11\"\n          + \"hum:env\"    = \"pr-3\"\n          + \"hum:res\"    = \"modules.node-workload.externals.db\"\n          + \"humanitec\"  = \"true\"\n          + \"managed_by\" = \"terraform\"\n        }\n      + vpc_id                  = (known after apply)\n    }\n\nPlan: 4 to add, 0 to change, 0 to destroy.\n\nChanges to Outputs:\n  + password = (sensitive value)\n\nError: Invalid value for input variable\n\n  on /home/runneruser/workspace/inputs/inputs.json line 1:\n   1: {\"allocated_storage\":20,\"app_id\":\"node11\",\"backup_retention_period\":1,\"create_cloudwatch_log_group\":false,\"create_db_subnet_group\":true,\"create_monitoring_role\":true,\"database_name\":\"my_database\",\"deletion_protection\":false,\"enabled_cloudwatch_logs_exports\":{},\"engine\":\"mysql\",\"engine_version\":\"8.0\",\"env_id\":\"pr-3\",\"group_family\":\"mysql8.0\",\"instance_class\":\"db.t4g.large\",\"major_engine_version\":\"8.0\",\"max_allocated_storage\":100,\"monitoring_interval\":60,\"monitoring_role_description\":\"Monitoring role for RDS basic cluster\",\"monitoring_role_name\":\"rds-basic-monitoring-role\",\"monitoring_role_use_name_prefix\":true,\"multi_az\":true,\"name\":\"hum-mysql-pr-3\",\"parameters\":{},\"password\":\"password\",\"performance_insights_enabled\":true,\"performance_insights_retention_period\":7,\"port\":3306,\"prefix\":\"hum-pr-3\",\"region\":\"us-east-2\",\"res_id\":\"modules.node-workload.externals.db\",\"skip_final_snapshot\":true,\"subnet_ids\":[\"subnet-00fd074a0dd669e94\",\"subnet-07e91cb234d6e2f6d\"],\"username\":\"username\",\"vpc_security_group_ids\":[\"sg-0cb0afd368a823caf\"]}\n\nThe given value is not suitable for var.enabled_cloudwatch_logs_exports\ndeclared at variables.tf:126,1-43: set of string required.\n\nError: Invalid value for input variable\n\n  on /home/runneruser/workspace/inputs/inputs.json line 1:\n   1: {\"allocated_storage\":20,\"app_id\":\"node11\",\"backup_retention_period\":1,\"create_cloudwatch_log_group\":false,\"create_db_subnet_group\":true,\"create_monitoring_role\":true,\"database_name\":\"my_database\",\"deletion_protection\":false,\"enabled_cloudwatch_logs_exports\":{},\"engine\":\"mysql\",\"engine_version\":\"8.0\",\"env_id\":\"pr-3\",\"group_family\":\"mysql8.0\",\"instance_class\":\"db.t4g.large\",\"major_engine_version\":\"8.0\",\"max_allocated_storage\":100,\"monitoring_interval\":60,\"monitoring_role_description\":\"Monitoring role for RDS basic cluster\",\"monitoring_role_name\":\"rds-basic-monitoring-role\",\"monitoring_role_use_name_prefix\":true,\"multi_az\":true,\"name\":\"hum-mysql-pr-3\",\"parameters\":{},\"password\":\"password\",\"performance_insights_enabled\":true,\"performance_insights_retention_period\":7,\"port\":3306,\"prefix\":\"hum-pr-3\",\"region\":\"us-east-2\",\"res_id\":\"modules.node-workload.externals.db\",\"skip_final_snapshot\":true,\"subnet_ids\":[\"subnet-00fd074a0dd669e94\",\"subnet-07e91cb234d6e2f6d\"],\"username\":\"username\",\"vpc_security_group_ids\":[\"sg-0cb0afd368a823caf\"]}\n\nThe given value is not suitable for var.parameters declared at\nvariables.tf:176,1-22: set of any single type required.\n",
      "object_id": "",
      "scope": "environment",
      "summary": "Humanitec Operator error"
    }
  }
]

```

</details>

### [View in Humanitec](https://app.humanitec.io/orgs/htc-demo-41/apps/node11/envs/pr-3/deploys/17ff59b3ac49904f)
Deployment ID: 17ff59b3ac49904f

### Domains:

node-workload: [node11-pr-3.apps.cluster-qqhfp.qqhfp.sandbox620.opentlc.com](https://node11-pr-3.apps.cluster-qqhfp.qqhfp.sandbox620.opentlc.com)

<details><summary>Deployment diff</summary>

### Deployment diff:
```json

{
  "modules": {
    "add": null,
    "remove": [],
    "update": {
      "node-workload": [
        {
          "from": "",
          "op": "replace",
          "path": "/spec/containers/node-service/image",
          "value": "quay-qqhfp.apps.cluster-qqhfp.qqhfp.sandbox620.opentlc.com/quayadmin/node11:c8c8807"
        },
        {
          "from": "",
          "op": "replace",
          "path": "/spec/annotations/humanitec.io~1workload-source",
          "value": "https://github.com/luizfaorg/node11/blob/3/merge/score.yaml"
        }
      ]
    }
  },
  "shared": null
}

```

</details>
